#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Creational Patterns Desing
#+SUBTITLE:  Brief description
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both

- Common properties
  + They work on the basis of how objects can be created
  + They isolate the details of object creation
  + Code is independent of the type of object to be created

* Samples

** Simple
   #+BEGIN_SRC python
   print("Its python src rendering test")
   #+END_SRC

   #+RESULTS:
   : Its python src rendering test

** Indentation hightlight
   #+BEGIN_SRC python
     for i in range (0, 12, 2):
         print('Next string')
         # comments there
         print(i)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Next string
   0
   Next string
   2
   Next string
   4
   Next string
   6
   Next string
   8
   Next string
   10
#+end_example
